IDENTIFICATION DIVISION.
PROGRAM-ID. ARITMETICA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 9(3) VALUE 10.
01 WS-B PIC 9(3) VALUE 4.
01 WS-T PIC 9(4).
PROCEDURE DIVISION.
MAIN.
    ADD WS-A WS-B GIVING WS-T.
    DISPLAY WS-T.
    SUBTRACT WS-B FROM WS-A GIVING WS-T.
    DISPLAY WS-T.
    MULTIPLY WS-A BY WS-B GIVING WS-T.
    DISPLAY WS-T.
    DIVIDE WS-A BY WS-B GIVING WS-T.
    DISPLAY WS-T.
    COMPUTE WS-T = WS-A + WS-B * 2.
    DISPLAY WS-T.
    STOP RUN.
