IDENTIFICATION DIVISION.
PROGRAM-ID. CONDICIONAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-X PIC S9(3) VALUE -5.
PROCEDURE DIVISION.
MAIN.
    IF WS-X > 0
        DISPLAY 'POSITIVO'
    ELSE
        IF WS-X = 0
            DISPLAY 'CERO'
        ELSE
            DISPLAY 'NEGATIVO'
        END-IF
    END-IF.
    STOP RUN.
