IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-I PIC 9(2) VALUE 0.
01 WS-F PIC 9(5) VALUE 1.
PROCEDURE DIVISION.
MAIN.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        COMPUTE WS-F = WS-F * WS-I
    END-PERFORM.
    DISPLAY WS-F.
    STOP RUN.
