IDENTIFICATION DIVISION.
PROGRAM-ID. NOMINA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-BRUTO   PIC 9(5)V99 VALUE 1500.50.
01 WS-DESC    PIC 9(5)V99 VALUE 0250.75.
01 WS-NETO    PIC 9(5)V99.
01 WS-DISP    PIC Z,ZZ9.99.
PROCEDURE DIVISION.
MAIN.
    COMPUTE WS-NETO = WS-BRUTO - WS-DESC.
    MOVE WS-NETO TO WS-DISP.
    DISPLAY 'NETO: ' WS-DISP.
    STOP RUN.
