IDENTIFICATION DIVISION.
PROGRAM-ID. CLASIFICAR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NOTA PIC 9(2) VALUE 75.
PROCEDURE DIVISION.
MAIN.
    EVALUATE WS-NOTA
        WHEN 1 THRU 49 DISPLAY 'REPROBADO'
        WHEN 50 THRU 69 DISPLAY 'REGULAR'
        WHEN 70 THRU 89 DISPLAY 'BUENO'
        WHEN OTHER DISPLAY 'EXCELENTE'
    END-EVALUATE.
    STOP RUN.
