IDENTIFICATION DIVISION.
PROGRAM-ID. VARYING.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-I PIC 9(2) VALUE 0.
01 WS-N PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN.
    PERFORM CONTAR VARYING WS-I FROM 1 BY 2 UNTIL WS-I > 9.
    DISPLAY WS-N.
    STOP RUN.
CONTAR.
    ADD 1 TO WS-N.
