IDENTIFICATION DIVISION.
PROGRAM-ID. EVALUAR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-EDAD PIC 9(3) VALUE 42.
PROCEDURE DIVISION.
MAIN.
    EVALUATE TRUE
        WHEN WS-EDAD < 18 DISPLAY 'MENOR'
        WHEN WS-EDAD < 65 DISPLAY 'ADULTO'
        WHEN OTHER DISPLAY 'MAYOR'
    END-EVALUATE.
    STOP RUN.
