IDENTIFICATION DIVISION.
PROGRAM-ID. CONDICION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-X PIC 9(3) VALUE 5.
01 WS-Y PIC 9(3) VALUE 7.
PROCEDURE DIVISION.
MAIN.
    IF WS-X > 0 AND WS-Y > 0
        DISPLAY 'AMBOS POSITIVOS'
    END-IF.
    IF WS-X = 5 OR WS-Y = 10
        DISPLAY 'UNO ENCAJA'
    END-IF.
    IF NOT WS-X = 0
        DISPLAY 'X DISTINTO DE CERO'
    END-IF.
    STOP RUN.
