IDENTIFICATION DIVISION.
PROGRAM-ID. TABLA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-T PIC 9(2) OCCURS 5 VALUE 0.
01 WS-I PIC 9(2) VALUE 0.
01 WS-SUM PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        COMPUTE WS-T(WS-I) = WS-I * 2
    END-PERFORM.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        ADD WS-T(WS-I) TO WS-SUM
    END-PERFORM.
    DISPLAY WS-SUM.
    STOP RUN.
