IDENTIFICATION DIVISION.
PROGRAM-ID. CADENAS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC X(5) VALUE 'JUAN '.
01 WS-B PIC X(5) VALUE 'PEREZ'.
01 WS-NAME PIC X(15).
01 WS-CSV PIC X(20) VALUE 'A,BB,CCC'.
01 WS-P1 PIC X(5).
01 WS-P2 PIC X(5).
01 WS-P3 PIC X(5).
PROCEDURE DIVISION.
MAIN.
    STRING WS-A WS-B DELIMITED BY SIZE INTO WS-NAME END-STRING.
    DISPLAY WS-NAME.
    UNSTRING WS-CSV DELIMITED BY ',' INTO WS-P1 WS-P2 WS-P3 END-UNSTRING.
    DISPLAY WS-P1.
    DISPLAY WS-P2.
    DISPLAY WS-P3.
    STOP RUN.
