IDENTIFICATION DIVISION.
PROGRAM-ID. INSPECCION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-S PIC X(20) VALUE 'BANANA'.
01 WS-N PIC 9(2) VALUE 0.
01 WS-R PIC X(20) VALUE 'BANANA'.
PROCEDURE DIVISION.
MAIN.
    INSPECT WS-S TALLYING WS-N FOR ALL 'A'.
    DISPLAY WS-N.
    INSPECT WS-R REPLACING ALL 'A' BY 'O'.
    DISPLAY WS-R.
    STOP RUN.
