IDENTIFICATION DIVISION.
PROGRAM-ID. CLASIFICA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-T PIC S9(3) VALUE -10.
PROCEDURE DIVISION.
MAIN.
    EVALUATE WS-T
        WHEN -100 THRU -1 DISPLAY 'NEGATIVO'
        WHEN 0 DISPLAY 'CERO'
        WHEN 1 THRU 100 DISPLAY 'POSITIVO'
        WHEN OTHER DISPLAY 'FUERA'
    END-EVALUATE.
    STOP RUN.
