IDENTIFICATION DIVISION.
PROGRAM-ID. RESETEAR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-REC.
   05 WS-A PIC 9(3) VALUE 99.
   05 WS-B PIC X(4) VALUE 'TEST'.
PROCEDURE DIVISION.
MAIN.
    DISPLAY WS-A.
    DISPLAY WS-B.
    INITIALIZE WS-REC.
    DISPLAY WS-A.
    DISPLAY WS-B.
    STOP RUN.
