IDENTIFICATION DIVISION.
PROGRAM-ID. BANDERA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-FLAG PIC X VALUE 'N'.
   88 ES-SI VALUE 'Y'.
   88 ES-NO VALUE 'N'.
PROCEDURE DIVISION.
MAIN.
    IF ES-NO DISPLAY 'INICIA NO' END-IF.
    SET ES-SI TO TRUE.
    IF ES-SI DISPLAY 'AHORA SI' END-IF.
    STOP RUN.
