IDENTIFICATION DIVISION.
PROGRAM-ID. RANGOPAR.
PROCEDURE DIVISION.
MAIN.
    PERFORM A THRU C.
    STOP RUN.
A.
    DISPLAY 'A'.
B.
    DISPLAY 'B'.
C.
    DISPLAY 'C'.
