IDENTIFICATION DIVISION.
PROGRAM-ID. FICHERO.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARCH ASSIGN TO '/tmp/chaka-corpus-18.dat'.
DATA DIVISION.
FILE SECTION.
FD ARCH.
01 REG PIC X(20).
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT ARCH.
    WRITE REG FROM 'LINEA UNO'.
    WRITE REG FROM 'LINEA DOS'.
    CLOSE ARCH.
    OPEN INPUT ARCH.
    READ ARCH NOT AT END DISPLAY REG END-READ.
    READ ARCH NOT AT END DISPLAY REG END-READ.
    CLOSE ARCH.
    STOP RUN.
