IDENTIFICATION DIVISION.
PROGRAM-ID. CALL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-N PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN.
    CALL 'SALUDA'.
    CALL 'SUMAR'.
    CALL 'SUMAR'.
    CALL 'NO-EXISTE' ON OVERFLOW DISPLAY 'FALLO' END-CALL.
    DISPLAY WS-N.
    STOP RUN.
SALUDA.
    DISPLAY 'HOLA DESDE SALUDA'.
SUMAR.
    ADD 1 TO WS-N.
