IDENTIFICATION DIVISION.
PROGRAM-ID. SEARCH.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-T PIC 9(3) OCCURS 5 VALUE 0.
01 WS-I PIC 9(3) VALUE 1.
PROCEDURE DIVISION.
MAIN.
    MOVE 10 TO WS-T(1).
    MOVE 20 TO WS-T(2).
    MOVE 30 TO WS-T(3).
    MOVE 40 TO WS-T(4).
    MOVE 50 TO WS-T(5).
    MOVE 1 TO WS-I.
    SEARCH WS-T VARYING WS-I
        AT END DISPLAY 'FALTA'
        WHEN WS-T(WS-I) = 30
            DISPLAY 'ENCONTRADO'
            DISPLAY WS-I
    END-SEARCH.
    MOVE 1 TO WS-I.
    SEARCH WS-T VARYING WS-I
        AT END DISPLAY 'FALTA'
        WHEN WS-T(WS-I) = 99 DISPLAY 'NUNCA'
    END-SEARCH.
    STOP RUN.
