IDENTIFICATION DIVISION.
PROGRAM-ID. SORT.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT WORK-F ASSIGN TO '/tmp/chaka-corpus-22-w.dat'.
    SELECT IN-F ASSIGN TO '/tmp/chaka-corpus-22-in.dat'.
    SELECT OUT-F ASSIGN TO '/tmp/chaka-corpus-22-out.dat'.
DATA DIVISION.
FILE SECTION.
SD WORK-F.
01 WORK-REC PIC X(20).
FD IN-F.
01 IN-REC PIC X(20).
FD OUT-F.
01 OUT-REC PIC X(20).
WORKING-STORAGE SECTION.
01 WS-DONE PIC 9 VALUE 0.
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT IN-F.
    WRITE IN-REC FROM 'CHARLIE'.
    WRITE IN-REC FROM 'ALPHA'.
    WRITE IN-REC FROM 'BRAVO'.
    CLOSE IN-F.
    SORT WORK-F ON ASCENDING KEY WORK-REC USING IN-F GIVING OUT-F.
    OPEN INPUT OUT-F.
    PERFORM UNTIL WS-DONE = 1
        READ OUT-F
            AT END MOVE 1 TO WS-DONE
            NOT AT END DISPLAY OUT-REC
        END-READ
    END-PERFORM.
    CLOSE OUT-F.
    STOP RUN.
