IDENTIFICATION DIVISION.
PROGRAM-ID. FILEOPS.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO '/tmp/chaka-corpus-23.dat'.
DATA DIVISION.
FILE SECTION.
FD F.
01 REG PIC X(10).
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT F.
    WRITE REG FROM 'INICIAL'.
    REWRITE REG FROM 'CAMBIO'
        INVALID KEY DISPLAY 'INVALIDA'
        NOT INVALID KEY DISPLAY 'OK-REWRITE'
    END-REWRITE.
    DELETE F
        NOT INVALID KEY DISPLAY 'OK-DELETE'
    END-DELETE.
    START F
        NOT INVALID KEY DISPLAY 'OK-START'
    END-START.
    CLOSE F.
    STOP RUN.
