IDENTIFICATION DIVISION.
PROGRAM-ID. COPY.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY '/tmp/chaka-corpus-24.cpy'.
PROCEDURE DIVISION.
MAIN.
    DISPLAY WS-MSG.
    STOP RUN.
