IDENTIFICATION DIVISION.
PROGRAM-ID. RELATIVO.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT MOV ASSIGN TO '/tmp/chaka-corpus-27.rel'
        ORGANIZATION IS RELATIVE
        ACCESS MODE IS DYNAMIC
        RELATIVE KEY IS MOV-NUM.
DATA DIVISION.
FILE SECTION.
FD MOV.
01 REG-MOV PIC X(6).
WORKING-STORAGE SECTION.
01 MOV-NUM PIC 9(2) VALUE 0.
01 WS-FIN  PIC X VALUE 'N'.
   88 FIN VALUE 'Y'.
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT MOV.
    MOVE 3 TO MOV-NUM.
    MOVE 'TRES' TO REG-MOV.
    WRITE REG-MOV.
    MOVE 1 TO MOV-NUM.
    MOVE 'UNO' TO REG-MOV.
    WRITE REG-MOV.
    MOVE 2 TO MOV-NUM.
    MOVE 'DOS' TO REG-MOV.
    WRITE REG-MOV.
    CLOSE MOV.
    OPEN I-O MOV.
    MOVE 2 TO MOV-NUM.
    READ MOV
        INVALID KEY DISPLAY 'NOHAY'
        NOT INVALID KEY DISPLAY 'POS2 ' REG-MOV
    END-READ.
    MOVE 2 TO MOV-NUM.
    DELETE MOV
        NOT INVALID KEY DISPLAY 'BORRA2'
    END-DELETE.
    MOVE 1 TO MOV-NUM.
    START MOV KEY >= MOV-NUM
        INVALID KEY DISPLAY 'VACIO'
    END-START.
    PERFORM UNTIL FIN
        READ MOV NEXT
            AT END SET FIN TO TRUE
            NOT AT END DISPLAY REG-MOV
        END-READ
    END-PERFORM.
    CLOSE MOV.
    STOP RUN.
