IDENTIFICATION DIVISION.
PROGRAM-ID. POTENCIA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-BASE PIC 9(4) VALUE 2.
01 WS-EXP  PIC 9(2) VALUE 10.
01 WS-R    PIC 9(6).
PROCEDURE DIVISION.
MAIN.
    COMPUTE WS-R = WS-BASE ** WS-EXP.
    DISPLAY WS-R.
    COMPUTE WS-R = 3 ** 4.
    DISPLAY WS-R.
    COMPUTE WS-R = 5 ** 0.
    DISPLAY WS-R.
    COMPUTE WS-R = WS-BASE ** 3 + 1.
    DISPLAY WS-R.
    STOP RUN.
